#include "common.h"

Key main_keyboard[] = {
    // Row 0 (Function Keys)
    { 2,  2, 8,  "ESC",   27 },
    { 2, 13, 5,  "F1",    KEY_F(1) },
    { 2, 18, 5,  "F2",    KEY_F(2) },
    { 2, 23, 5,  "F3",    KEY_F(3) },
    { 2, 28, 5,  "F4",    KEY_F(4) },

    { 2, 34, 5,  "F5",    KEY_F(5) },
    { 2, 39, 5,  "F6",    KEY_F(6) },
    { 2, 44, 5,  "F7",    KEY_F(7) },
    { 2, 49, 5,  "F8",    KEY_F(8) },

    { 2, 55, 5,  "F9",    KEY_F(9) },
    { 2, 60, 5,  "F10",    KEY_F(10) },
    { 2, 65, 5,  "F11",    KEY_F(11) },
    { 2, 70, 5,  "F12",    KEY_F(12) },
    
    // Row 1 (Numbers) - 총 너비 55 (2~57)
    { 5,  2, 5,  "`",     '`' },
    { 5,  7, 5,  "1",     '1' },
    { 5, 12, 5,  "2",     '2' },
    { 5, 17, 5,  "3",     '3' },
    { 5, 22, 5,  "4",     '4' },
    { 5, 27, 5,  "5",     '5' },
    { 5, 32, 5,  "6",     '6' },
    { 5, 37, 5,  "7",     '7' },
    { 5, 42, 5,  "8",     '8' },
    { 5, 47, 5,  "9",     '9' },
    { 5, 52, 5,  "0",     '0' },
    { 5, 57, 5,  "-",     '-' },
    { 5, 62, 5,  "=",     '=' },
    { 5, 67, 8,  "BSP",   KEY_BACKSPACE },

    // Row 2 (QWE...)
    { 8,  2, 8,  "TAB",   '\t' }, 
    { 8, 10, 5,  "Q",     'q',  1,   0,   ZONE0 },
    { 8, 15, 5,  "W",     'w',  1,   0,   ZONE0 },
    { 8, 20, 5,  "E",     'e',  1,   0,   ZONE0 },
    { 8, 25, 5,  "R",     'r',  1,   0,   ZONE0 },
    { 8, 30, 5,  "T",     't',  1,   0,   ZONE0 },
    { 8, 35, 5,  "Y",     'y',  1,   0,   ZONE1 },
    { 8, 40, 5,  "U",     'u',  1,   0,   ZONE1 },
    { 8, 45, 5,  "I",     'i',  1,   0,   ZONE1 },
    { 8, 50, 5,  "O",     'o',  1,   0,   ZONE1 },
    { 8, 55, 5,  "P",     'p',  1,   0,   ZONE1 },
    { 8, 60, 5,  "[",     '['},
    { 8, 65, 5,  "]",     ']'},
    { 8, 70, 5,  "\\",    '\\'},

    // Row 3 (ASD...)
    { 11,  2, 9,  "CAPS",  -10 },    
    { 11, 11, 5,  "A",     'a',  1,   0,   ZONE2 },
    { 11, 16, 5,  "S",     's',  1,   0,   ZONE2 },
    { 11, 21, 5,  "D",     'd',  1,   0,   ZONE2 },
    { 11, 26, 5,  "F",     'f',  1,   0,   ZONE2 },
    { 11, 31, 5,  "G",     'g',  1,   0,   ZONE2 },
    { 11, 36, 5,  "H",     'h',  1,   0,   ZONE2 },
    { 11, 41, 5,  "J",     'j',  1,   0,   ZONE2 },
    { 11, 46, 5,  "K",     'k',  1,   0,   ZONE2 },
    { 11, 51, 5,  "L",     'l',  1,   0,   ZONE2 },
    { 11, 56, 5,  ";",     ';', },
    { 11, 61, 5,  "\'",     '\'', },
    { 11, 66, 9, "ENTER", '\n' },  

    // Row 4 (ZXC...)
    { 14,  2, 12, "SHIFT", -10 },   // Left Shift
    { 14, 14, 5,  "Z",     'z',  1,   0,   ZONE3 },
    { 14, 19, 5,  "X",     'x',  1,   0,   ZONE3 },
    { 14, 24, 5,  "C",     'c',  1,   0,   ZONE3 },
    { 14, 29, 5,  "V",     'v',  1,   0,   ZONE3 },
    { 14, 34, 5,  "B",     'b',  1,   0,   ZONE3 },
    { 14, 39, 5,  "N",     'n',  1,   0,   ZONE3 },
    { 14, 44, 5,  "M",     'm',  1,   0,   ZONE3 },
    { 14, 49, 5,   ",",   ',' },
    { 14, 54, 5,   ".",   '.' },
    { 14, 59, 5,   "/",   '/' },
    { 14, 64, 11, "SHIFT", -10 },   // Right Shift

    // Row 5 (Spacebar)
    { 17, 2, 9, "CTRL", -10 },
    { 17, 11, 5, "WIN", -10 },
    { 17, 16, 5, "ALT", -10 },
    { 17, 21, 27, "SPACE", ' ' },
    { 17, 48, 8, "KO/ENG", -10 },
    { 17, 56, 5, "HAN", -10 },
    { 17, 61, 5, "ALT", -10 },
    { 17, 66, 9, "CTRL", -10 },
};

Store shop_stock[] = {
    // { 영어이름, 한국어이름, 구매가, 판매가, 성장시간, 설명, 타입, 구역 }
    
    // 씨앗류
    {"Asparagus", "아스파라거스", 3, 5, 20, "", TYPE_SEED, ZONE0},
    {"Broccoli", "브로콜리", 5, 8, 20, "", TYPE_SEED, ZONE0},
    {"Carrot", "당근", 5, 15, 30, "", TYPE_SEED, ZONE0},
    {"Dandelion", "민들레", 10, 20, 30, "", TYPE_SEED, ZONE0},
    {"Eggplant", "가지", 10, 30, 60, "", TYPE_SEED, ZONE0},
    {"Fern", "고사리", 10, 20, 120, "물없이 자람", TYPE_SEED, ZONE1},
    {"Garlic", "마늘", 20, 40, 120, "병충해 면역", TYPE_SEED, ZONE1},
    {"Herb", "허브", 20, 100, 600, "", TYPE_SEED, ZONE1},
    {"Iris", "붓꽃", 50, 100, 300, "황금작물 확률", TYPE_SEED, ZONE1},
    {"Jalapeno", "할라피뇨", 50, 80, 300, "절대 안 썩음", TYPE_SEED, ZONE1},
    {"Kale", "케일", 70, 150, 360, "", TYPE_SEED, ZONE2},
    {"Lettuce", "상추", 100, 200, 600, "", TYPE_SEED, ZONE2},
    {"Mushroom", "버섯", 100, 150, 200, "밤에 2배 빠름", TYPE_SEED, ZONE2},
    {"Nettle", "쐐기풀", 50, 200, 600, "수확시 5번 클릭", TYPE_SEED, ZONE2},
    {"Onion", "양파", 100, 200, 1200, "병충해 면역", TYPE_SEED, ZONE2},
    {"Potato", "감자", 150, 160, 600, "수확시 씨앗리필", TYPE_SEED, ZONE2},
    {"Quinoa", "퀴노아", 200, 500, 3600, "", TYPE_SEED, ZONE2},
    {"Radish", "무", 300, 700, 3600, "", TYPE_SEED, ZONE2},
    {"Spinach", "시금치", 300, 1000, 7200, "", TYPE_SEED, ZONE2},
    {"Tomato", "토마토", 50, 100, 100, "30분뒤 썩음", TYPE_SEED, ZONE2},
    {"Ulluco", "울루코", 300, 350, 3600, "수확시 씨앗리필", TYPE_SEED, ZONE3},
    {"Vanilla", "바닐라", 500, 1000, 4800, "", TYPE_SEED, ZONE3},
    {"Watercress", "물냉이", 300, 1000, 600, "물없으면 썩음", TYPE_SEED, ZONE3},
    {"Xylosma", "산유자나무", 500, 600, 3600, "인접방향 퍼짐", TYPE_SEED, ZONE3},
    {"Yam", "마", 1000, 2000, 7200, "", TYPE_SEED, ZONE3},
    {"Zucchini", "애호박", 2000, 4000, 36000, "", TYPE_SEED, ZONE3},

    // 장비류 
    {"Land Deed", "텃밭 확장", 100, 0, 0, "다음 구역 해금", TYPE_EQUIP, ZONE0}, 
    {"Fertilizer", "비료", 1000, 0, 0, "작물 성장속도 UP", TYPE_EQUIP, ZONE0}, 
    {"Pesticide", "농약", 500, 0, 0, "전체 병충해 0%", TYPE_EQUIP, ZONE1}, 
    {"Sprinkler", "스프링클러", 2000, 0, 0, "자동 물주기", TYPE_EQUIP, ZONE1}, 
    {"Scarecrow", "허수아비", 2000, 0, 0, "병충해 영구 제거", TYPE_EQUIP, ZONE2}, 
    {"Placard", "플래카드", 100000, 0, 0, "텃밭 꾸미기", TYPE_EQUIP, ZONE3} 
};
